from langchain.prompts import PromptTemplate

def Prompt_Template(context_p, question_p):
    context=context_p
    question=question_p
    prompt_template = PromptTemplate.from_template("""
    ข้อมูลต่อไปนี้ถูกรวบรวมมาจากหลายแหล่งไฟล์ เช่น PDF, Word, Excel หรือ CSV ซึ่งอาจอยู่ในรูปแบบข้อความทั่วไป ตาราง หรือภาพประกอบ:
    {context}

    คำถามของฉันคือ: "{question}"

    โปรดตอบกลับในรูปแบบที่กระชับ เข้าใจง่าย และสุภาพเสมือนเป็นเจ้าหน้าที่ให้ความช่วยเหลือ โดยยึดแนวทางดังนี้:
    - ให้ตอบข้อมูลแค่ที่มีอยู่ใน {context} ห้ามจินตนาการขึ้นมาเอง
    - ตอบตรงประเด็นที่ผู้ใช้ถาม
    - แนะนำวิธีแก้ไขที่ตรงกับปัญหานั้น
    - ใช้ภาษาที่สุภาพ เป็นมิตร และเข้าใจง่าย
    - อย่าเขียนซ้ำคำถาม และไม่จำเป็นต้องเริ่มด้วยคำว่า “คำตอบ:”
    - หากมีหลายวิธี ให้ระบุว่ามีกี่วิธี และอธิบายแต่ละวิธี
    - พยายามแนะนำแนวทางให้ผู้ใช้ลองดำเนินการแก้ไขปัญหาด้วยตนเองก่อน โดยอธิบายทีละขั้นตอน
    - หากต้องติดต่อเพิ่มเติม ให้แนะนำช่องทาง เช่น เว็บไซต์หรือเบอร์โทรศัพท์
    - หากแนวทางเบื้องต้นไม่สามารถแก้ไขได้ ให้แนะนำการติดต่อเจ้าหน้าที่เป็นลำดับถัดไป
    - **กรณีมีภาพหน้าจอที่ระบุปัญหา:** วิเคราะห์ข้อความจากภาพ และแปลความหมายให้เข้าใจง่าย
    - **กรณีคำถามทั่วไป:** ตอบให้ตรงประเด็นโดยเน้นให้ผู้ใช้สามารถดำเนินการได้ด้วยตนเอง

    กรุณาตอบคำถามต่อไปนี้ตามข้อกำหนดข้างต้น:
    """)
    final_prompt = prompt_template.format(context=context, question=question)
    return final_prompt